var grupoTarjetas = [
  ["🍏", "🍎"],
  ["🍒", "🍉"],
  ["🥝", "🍍", "🍊", "🍑"],
  ["🍇", "🍌", "🍋", "🥑"],
  ["🍆", "🥥", "🍅", "🍈"],
];

var tarjetasFrutas = [
  ["🍏", "🍎"],
  ["🍒", "🍉"],
  ["🥝", "🍍", "🍊", "🍑"],
  ["🍇", "🍌", "🍋", "🥑"],
  ["🍆", "🥥", "🍅", "🍈"],
];

var tarjetasAnimales = [
  ["🐻", "🦁"],
  ["🐯", "🐮"],
  ["🐸", "🐷", "🐹", "🐶"],
  ["🐱", "🐭", "🐰", "🦊"],
  ["🐼", "🐨", "🦝", "🐗"],
];

var tarjetasModa = [
  ["👗", "👙"],
  ["👚", "👖"],
  ["👕", "🥼", "👢", "👡"],
  ["👟", "💼", "🕶", "👜"],
  ["👒", "🥾", "🥿", "👘"],
];

var tarjetasNatural = [
  ["🌺", "🍃"],
  ["🍀", "🍁"],
  ["🌵", "🌲", "🌴", "🍂"],
  ["🎋", "🍄", "🌷", "🌻"],
  ["🌼", "🌸", "💐", "🌳"],
];

var movimientos = 0;
var nivelActual = 0;
var tarjetasPendientes;
var puntuacion = 0;
var tarjetasSeguidas = false;
var sePuedeComprar;

var niveles;
